console.groupCollapsed("\n%c  %c考试时钟 ExamClock", "background:url('/gvbhj111/xwyz-exam-clock/edit/main/js/favicon.ico') no-repeat;padding:32px;", "font:bold 36px sans-serif;color:#3a9;");
console.log("\n项目仓库：https://github.com/L33Z22L11/ExamClock\n野生技协群：894656456\n\n");
console.groupEnd();
/* 
 * 适用于宣威一中的考试科目列表
 */

let specialDate = {
  cee25: parseInt((new Date(2026, 6, 7) - Date.now()) / 864E5),
}

exams["2022-05-14"] = {
  type: "临时考练",
  mainSlogan: `${specialDate.cee22}天后 峰顶相会`,
  schedule() {
    $("考练", today.date, "22:30", "23:30");
  }
};

exams[25] = {
  type: "高三·日常",
  author: "招募“高三·日常”维护者",
  origin: "高三年级部",
  mainSlogan: `距离高考${specialDate.cee25}天`,
  rollSlogan: ["以梦为马，不负韶华。冲刺高考，加油少年！"],
  earlyAdmit: 2,
  schedule() {
     $("早读", today.date, "07:10", "07:40");
    $("第1节", today.date, "07:50", "08:30");
    $("第2节", today.date, "08:40", "09:20");
    $("第3节", today.date, "09:30", "10:10");
    $("课间操", today.date, "10:20", "10:30");
    $("第4节", today.date, "10:35", "11:15");
    $("第5节", today.date, "11:25", "12:05");
    $("第6节", today.date, "14:45", "15:25");
    $("第7节", today.date, "15:35", "16:15");
    $("第8节", today.date, "16:30", "17:10");
    $("小检测", today.date, "17:40", "18:30");
    $("第9节", today.date, "18:50", "19:35");
    $("第10节", today.date, "20:10", "20:30");
    $("第11节", today.date, "20:40", "21:25");
    $("自习", today.date, "21:50", "22:30");
  }
};

exams[251] = {
  type: "高三",
  author: "来源:暂无",
  origin: "高三年级部",
  rollSlogan: ["曲靖市第一次质量检测（暂无）：请以实际铃声为准。"],
  voiceReminder: true,
  schedule() {
    $("语文", "2024-12-20", "09:00", "11:30");
    $("数学", "2024-12-20", "15:00", "17:00");
    $("物理", "2024-12-21", "09:00", "10:15");
    $("外语", "2024-12-21", "15:00", "17:00");
    $("化学", "2024-12-22", "08:30", "09:45");
    $("地理", "2024-12-22", "11:00", "12:15");
    $("政治", "2024-12-22", "14:30", "15:45");
    $("生物", "2024-12-22", "17:00", "18:40");
  }
};



exams[253] = {
  type: "高三·模考",
  author: "",
  origin: "高三年级部",
  rollSlogan: ["高三合格性模拟考试：请以实际铃声为准。"],
  voiceReminder: true,
  schedule() {
    $("数学", today.date, "07:30", "09:00");
    $("语文", today.date, "09:20", "10:50");
    $("化/史", today.date, "11:10", "12:10");
    $("英语", today.date, "14:25", "15:55");
    $("政治", today.date, "16:15", "17:15");
    $("物理", today.date, "17:35", "18:35");
  }
};

exams[26] = {
  type: "高二日常",
  author: "来源:灵亡",
  origin: "高一年级部",
  mainSlogan: "以梦为马，不负韶华。",
  rollSlogan: ["自立·自治·自觉·自动"],
   schedule() {
    $("早读", today.date, "07:10", "07:40");
    $("第1节", today.date, "07:50", "08:30");
    $("第2节", today.date, "08:40", "09:20");
    $("第3节", today.date, "09:30", "10:10");
    $("课间操", today.date, "10:20", "10:30");
    $("第4节", today.date, "10:35", "11:15");
    $("第5节", today.date, "11:25", "12:05");
    $("第6节", today.date, "14:45", "15:25");
    $("第7节", today.date, "15:35", "16:15");
    $("第8节", today.date, "16:30", "17:10");
    $("小检测", today.date, "17:40", "18:30");
    $("第9节", today.date, "18:50", "19:35");
    $("第10节", today.date, "20:10", "20:30");
    $("第11节", today.date, "20:40", "21:25");
    $("读报", today.date, "21:35", "21:50");
    $("自习", today.date, "21:50", "22:30");
  }
};

exams[261] = {
  type: "高二·物理",
  author: "来源:暂无",
  origin: "2026届年级部",
  rollSlogan: ["宣威一中高二上学期第一次月考：请以实际时间为准。"],
  voiceReminder: true,
  schedule() {
    $("英语", "2025-10-10", "18:50", "20:50");
    $("物理", "2025-10-10", "21:15", "22:30");
    $("语文", "2025-10-11", "09:30", "12:00");
    $("数学", "2025-10-11", "15:00", "17:00");
    $("生物", "2025-10-11", "19:35", "20:50");
    $("化学", "2025-10-11", "21:15", "22:30");
  }
};

exams[262] = {
  type: "高二 · 历史",
  author: "来源:高二年级",
  origin: "高二年级部",
  rollSlogan: ["宣威一中高二上学期第一次月考：请以实际时间为准。"],
  voiceReminder: true,
  schedule() {
    $("英语", "2025-10-10", "18:50", "20:50");
    $("历史", "2025-10-10", "21:15", "22:30");
    $("语文", "2025-10-11", "09:30", "12:00");
    $("数学", "2025-10-11", "15:00", "17:00");
    $("地理", "2025-10-11", "19:35", "20:50");
    $("政治", "2025-10-11", "21:15", "22:30");
  }
};

exams[27] = {
  type: "高一日常",
  author: "来源:灵亡",
  origin: "高一年级部",
  mainSlogan: "以梦为马，不负韶华。",
  rollSlogan: ["自立·自治·自觉·自动"],
  schedule() {
    $("早读", today.date, "07:10", "07:40");
    $("第1节", today.date, "07:50", "08:30");
    $("第2节", today.date, "08:40", "09:20");
    $("第3节", today.date, "09:30", "10:10");
    $("课间操", today.date, "10:20", "10:30");
    $("第4节", today.date, "10:35", "11:15");
    $("第5节", today.date, "11:25", "12:05");
    $("第6节", today.date, "14:45", "15:25");
    $("第7节", today.date, "15:35", "16:15");
    $("第8节", today.date, "16:30", "17:10");
    $("小检测", today.date, "17:40", "18:30");
    $("第9节", today.date, "18:50", "19:35");
    $("第10节", today.date, "20:10", "20:30");
    $("第11节", today.date, "20:40", "21:25");
    $("读报", today.date, "21:35", "21:50");
    $("自习", today.date, "21:50", "22:30");
  }
};
exams[271] = {
  type: "高一·物理",
  author: "来源:高一年级",
  origin: "高一年级部",
  rollSlogan: ["宣威市2025年高一春季学期教学质量期末监测：请以实际时间为准。"],
  voiceReminder: true,
  schedule() {
    $("语文", "2025-07-06", "09:00", "11:30");
    $("数学", "2025-07-06", "15:00", "17:00");
    $("物理", "2025-07-07", "09:00", "10:30");
    $("英语", "2025-07-07", "15:00", "17:00");
    $("化学", "2025-07-08", "08:30", "10:00");
    $("生物", "2025-07-08", "16:30", "18:00");
  }
};

exams[272] = {
  type: "高一 · 历史",
  author: "来源:高一年级",
  origin: "高一年级部",
  rollSlogan: ["宣威市2025年高一春季学期教学质量期末监测：请以实际时间为准。"],
  voiceReminder: true,
  schedule() {
   $("语文", "2025-07-06", "09:00", "11:30");
    $("数学", "2025-07-06", "15:00", "17:00");
    $("历史", "2025-07-07", "09:00", "10:30");
    $("英语", "2025-07-07", "15:00", "17:00");
    $("地理", "2025-07-08", "10:30", "12:00");
    $("政治", "2025-07-08", "14:30", "16:00");
    }
};


exams[273] = {
  type: "高二·周考",
  author: "来源:灵亡",
  origin: "高二年级部",
  mainSlogan: "沉着冷静 诚信考试 ",
  rollSlogan: ["自立·自治·自觉·自动"],
  schedule() {
    $("数学", "2025-09-07", "17:50", "19:50"); 
    $("物理","2025-09-14", "18:40", "19:55"); 
    $("化学","2025-09-14", "20:10", "21:25");
    $("英语","2025-09-21", "19:00", "21:00"); 
    $("生物","2025-09-21", "21:15", "22:30"); 
    $("数学","2025-09-28", "19:20", "21:20"); 
    $("物理","2025-10-05", "18:40", "19:55"); 
    $("化学","2025-10-05", "20:10", "21:25"); 
    $("语文","2025-10-12", "20:00", "22:30"); 
    $("数学","2025-10-19", "19:00", "21:00"); 
    $("生物","2025-10-19", "21:15", "22:30"); 
    $("物理","2025-10-26", "18:40", "19:55"); 
    $("化学","2025-10-26", "20:10", "21:25");
    $("英语","2025-11-02", "19:20", "21:20");
    $("数学","2025-11-09", "19:00", "21:00");
    $("生物","2025-11-09", "21:15", "22:30"); 
    $("物理","2025-11-16", "18:40", "19:55");
    $("化学","2025-11-16", "20:10", "21:25");
    $("数学","2025-11-23", "19:00", "21:00");
    $("生物","2025-11-23", "21:15", "22:30");
    $("语文","2025-11-30", "20:00", "22:30");
    $("英语","2025-12-07", "19:00", "21:00"); 
    $("物理","2025-12-07", "21:15", "22:30"); 
    $("化学","2025-12-14", "18:40", "19:55");
    $("生物","2025-12-14", "20:10", "21:25"); 
    $("数学","2025-12-21", "19:20", "21:20"); 
    $("生物","2025-12-28", "18:40", "19:55");
    $("化学","2025-12-28", "20:10", "21:25"); 
    $("数学","2026-01-04", "19:00", "21:00"); 
    $("物理","2026-01-04", "21:15", "22:30");
    $("语文","2026-01-11", "20:00", "22:30");
    $("数学","2026-01-18", "19:00", "21:00");
    $("物理","2026-01-18", "21:15", "22:30"); 
    $("化学","2026-01-25", "18:40", "19:55");
    $("生物","2026-01-25", "20:10", "21:25"); 
    $("数学","2026-02-01", "19:20", "21:20");
    $("英语","2026-02-08", "17:50", "19:50");
  }
};


      
exams[301] = {
  type: "研究生",
  author: "whatever",
  origin: "公共服务",
  rollSlogan: ["研究生初试模拟：公共服务。"],
  schedule() {
    $("上午", today.date, "08:30", "11:30");
    $("下午", today.date, "14:00", "17:00");
  }
};

exams[302] = {
  type: "学考",
  author: "云南省招生考试院",
  origin: "学考",
  rollSlogan: ["云南省普通高中学业水平合格性考试：请以广播提示为准。"],
  schedule() {
    $("历史","2025-07-09", "08:30", "10:00");
    $("通用技术", "2025-07-09", "11:00", "11:50");
    $("地理", "2025-07-09", "14:00", "15:30");
    $("生物学", "2025-07-09", "16:30", "18:00");
    $("语文", "2025-07-10", "08:30", "10:30");
    $("物理","2025-07-10", "14:00", "15:30");
    $("英语", "2025-07-10", "16:30", "18:10");
    $("数学", "2025-07-11", "08:30", "10:10");
    $("信息技术", "2025-07-11", "11:10", "12:00");
    $("化学", "2025-07-11", "14:00", "15:30");
    $("思想政治", "2025-07-11", "16:30", "18:10");
  }
};
